In [8]:
# Inner Merge
import pandas as pd
import numpy as np 

registration = {
    'name': ['Alice', 'Bob', 'Charlie', 'yolanda'],
    'email': ['alice@email.com', 'bob@email.com', 'charlie@email.com', 'david@email.com'],
    'registration_date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04']
}

login = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'last_login': ['2025-01-20', '2025-01-22', '2025-01-18', '2025-01-25'],
    'login_count': [45, 32, 28, 51]
}

register= pd.DataFrame(registration)
login=pd.DataFrame(login)

merging=pd.merge(register,login,how='outer',on='name')
merging
# index merging
register
login

      name  last_login  login_count
0    Alice  2025-01-20           45
1      Bob  2025-01-22           32
2  Charlie  2025-01-18           28
3    David  2025-01-25           51

In [14]:
register

      name              email registration_date
0    Alice    alice@email.com        2024-01-01
1      Bob      bob@email.com        2024-01-02
2  Charlie  charlie@email.com        2024-01-03
3  yolanda    david@email.com        2024-01-04

In [11]:
login

      name  last_login  login_count
0    Alice  2025-01-20           45
1      Bob  2025-01-22           32
2  Charlie  2025-01-18           28
3    David  2025-01-25           51

In [19]:
pd.merge(register,login,on='name',how='inner')

      name              email registration_date  last_login  login_count
0    Alice    alice@email.com        2024-01-01  2025-01-20           45
1      Bob      bob@email.com        2024-01-02  2025-01-22           32
2  Charlie  charlie@email.com        2024-01-03  2025-01-18           28